

Q.1
mysql> CREATE TABLE departments (
    -> department_id INT unsigned auto_increment PRIMARY KEY,
    -> name VARCHAR(20),
    -> created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    -> updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    -> );
mysql> DESC departments
    -> ;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | YES  |     | NULL              |                                               |
| created_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+

mysql> ALTER TABLE departments MODIFY COLUMN name VARCHAR(20) NOT NULL;
mysql> DESC departments;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | NO   |     | NULL              |                                               |
| created_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+




Q.2
mysql> ALTER TABLE people ADD department_id INT unsigned AFTER email;
mysql> DESC people;
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type             | Null | Key | Default           | Extra                                         |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id     | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)      | NO   |     | NULL              |                                               |
| email         | varchar(255)     | YES  | UNI | NULL              |                                               |
| department_id | int unsigned     | YES  |     | NULL              |                                               |
| age           | tinyint unsigned | YES  |     | NULL              |                                               |
| gender        | tinyint          | YES  |     | NULL              |                                               |
| created_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+




Q.3
mysql> INSERT INTO departments (name) 
    -> VALUES
    -> ('営業'),
    -> ('開発'),
    -> ('経理'),
    -> ('人事'),
    -> ('情報システム');
mysql> SELECT * FROM departments;
    +---------------+--------------------+---------------------+---------------------+
| department_id | name               | created_at          | updated_at          |
+---------------+--------------------+---------------------+---------------------+
|             1 | 営業               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             2 | 開発               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             3 | 経理               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             4 | 人事               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             5 | 情報システム       | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
+---------------+--------------------+---------------------+---------------------+

mysql> INSERT INTO people (name,email,department_id,age,gender)
    -> VALUES
    -> ('あ', 'email1', '1', '10', '1'),
    -> ('い', 'email2', '1', '15', '1'),
    -> ('う', 'email3', '1', '20', '1'),
    -> ('え', 'email4', '2', '25', '2'),
    -> ('お', 'email5', '2', '30', '2'),
    -> ('か', 'email6', '2', '35', '2'),
    -> ('き', 'email7', '2', '40', '2'),
    -> ('く', 'email8', '3', '45', '1'),
    -> ('け', 'email9', '4', '50', '2'),
    -> ('こ', 'email10', '5', '55', '1');
    mysql> SELECT name, email, department_id, age, gender FROM people;
    +-----------------------+---------------------+---------------+------+--------+
| name                  | email               | department_id | age  | gender |
+-----------------------+---------------------+---------------+------+--------+
| 鈴木たかし            | suzuki@gizumo.jp    |          NULL |   20 |      1 |
| 田中ゆうこ            | tanaka@gizumo.jp    |          NULL |   25 |      2 |
| 福田だいすけ          | fukuda@gizumo.jp    |          NULL |   42 |      1 |
| 豊島はなこ            | toyoshima@gizumo.jp |          NULL |   34 |      2 |
| 不思議沢みちこ        | NULL                |          NULL | NULL |   NULL |
| あ                    | email1              |             1 |   10 |      1 |
| い                    | email2              |             1 |   15 |      1 |
| う                    | email3              |             1 |   20 |      1 |
| え                    | email4              |             2 |   25 |      2 |
| お                    | email5              |             2 |   30 |      2 |
| か                    | email6              |             2 |   35 |      2 |
| き                    | email7              |             2 |   40 |      2 |
| く                    | email8              |             3 |   45 |      1 |
| け                    | email9              |             4 |   50 |      2 |
| こ                    | email10             |             5 |   55 |      1 |
+-----------------------+---------------------+---------------+------+--------+

mysql> INSERT INTO reports (person_id, content)
    -> VALUES
    -> ('7', 'あいうえおあいうえお'),
    -> ('8', 'かきくけこさしすせそ'),
    -> ('9', 'たちつてとなにぬねの'),
    -> ('10', 'はひふへほまみむめも'),
    -> ('11', 'わたしはわたしは私は'),
    -> ('12', 'カンガルーカンガルー'),
    -> ('13', 'ラッパラッパラッパラッパ'),
    -> ('14', 'けん玉けん玉けん玉けん玉'),
    -> ('15', '音声音声音声音声音声音声'),
    -> ('16', '難しい難しい難しい難しい');
mysql> SELECT * FROM reports;
+-----------+-----------+--------------------------------------+---------------------+---------------------+
| report_id | person_id | content                              | created_at          | updated_at          |
+-----------+-----------+--------------------------------------+---------------------+---------------------+
|         1 |         7 | あいうえおあいうえお                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         2 |         8 | かきくけこさしすせそ                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         3 |         9 | たちつてとなにぬねの                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         4 |        10 | はひふへほまみむめも                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         5 |        11 | わたしはわたしは私は                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         6 |        12 | カンガルーカンガルー                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         7 |        13 | ラッパラッパラッパラッパ             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         8 |        14 | けん玉けん玉けん玉けん玉             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         9 |        15 | 音声音声音声音声音声音声             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|        10 |        16 | 難しい難しい難しい難しい             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
+-----------+-----------+--------------------------------------+---------------------+---------------------+




Q.4
mysql> UPDATE people SET department_id =4 WHERE person_id IN(1,2,3,4,6);
mysql> SELECT * FROM people;
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email               | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし            | suzuki@gizumo.jp    |             4 |   20 |      1 | 2024-10-06 16:08:33 | 2024-10-10 20:13:20 |
|         2 | 田中ゆうこ            | tanaka@gizumo.jp    |             4 |   25 |      2 | 2024-10-06 16:19:19 | 2024-10-10 20:13:20 |
|         3 | 福田だいすけ          | fukuda@gizumo.jp    |             4 |   42 |      1 | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         4 | 豊島はなこ            | toyoshima@gizumo.jp |             4 |   34 |      2 | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         6 | 不思議沢みちこ        | NULL                |             4 | NULL |   NULL | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         7 | あ                    | email1              |             1 |   10 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|         8 | い                    | email2              |             1 |   15 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|         9 | う                    | email3              |             1 |   20 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        10 | え                    | email4              |             2 |   25 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        11 | お                    | email5              |             2 |   30 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        12 | か                    | email6              |             2 |   35 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        13 | き                    | email7              |             2 |   40 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        14 | く                    | email8              |             3 |   45 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        15 | け                    | email9              |             4 |   50 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        16 | こ                    | email10             |             5 |   55 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+




Q.5
mysql> SELECT name,age FROM people WHERE gender =1 ORDER BY age DESC;
+--------------------+------+
| name               | age  |
+--------------------+------+
| こ                 |   55 |
| く                 |   45 |
| 福田だいすけ       |   42 |
| 鈴木たかし         |   20 |
| う                 |   20 |
| い                 |   15 |
| あ                 |   10 |
+--------------------+------+




Q.6
FROMで表示したいデータがあるテーブル（people）を選択する。
SELECTでどのカラム（name,email,age）を表示するか、WHEREで特定のレコード（department_id = 1）を指定する。
それによりpeopleテーブルにいるdepartment_id = 1の人のname,email,ageの情報のみ表示される。
また、ORDER BYのカラム名がcreated_at（コンテンツの作成日時）でASDやDESCが指定されていない。
よってデフォルトのASDが指定される為、コンテンツの作成日時順に上から表示される。




Q.7
mysql> SELECT name FROM people WHERE age >= 20 AND age < 30 AND gender = 2 OR age >= 40 AND age < 50 AND gender = 1;
+--------------------+
| name               |
+--------------------+
| 田中ゆうこ         |
| 福田だいすけ       |
| え                 |
| く                 |
+--------------------+




Q.8
mysql> SELECT name FROM people WHERE department_id =1 ORDER BY age ASC;
+------+
| name |
+------+
| あ   |
| い   |
| う   |
+------+




Q.9
mysql> SELECT AVG(age) AS average_age FROM people WHERE gender = 2 AND  department_id = 2;
+-------------+
| average_age |
+-------------+
|     32.5000 |
+-------------+




Q.10
SELECT p.name, d.name, r.content FROM people p JOIN reports r  USING (person_id) JOIN departments d USING(department_id);
+------+--------------------+--------------------------------------+
| name | name               | content                              |
+------+--------------------+--------------------------------------+
| あ   | 営業               | あいうえおあいうえお                 |
| い   | 営業               | かきくけこさしすせそ                 |
| う   | 営業               | たちつてとなにぬねの                 |
| え   | 開発               | はひふへほまみむめも                 |
| お   | 開発               | わたしはわたしは私は                 |
| か   | 開発               | カンガルーカンガルー                 |
| き   | 開発               | ラッパラッパラッパラッパ             |
| く   | 経理               | けん玉けん玉けん玉けん玉             |
| け   | 人事               | 音声音声音声音声音声音声             |
| こ   | 情報システム       | 難しい難しい難しい難しい             |
+------+--------------------+--------------------------------------+




Q.11
SELECT p.name FROM people p LEFT OUTER JOIN reports r USING (person_id) WHERE content IS NULL;;
+-----------------------+
| name                  |
+-----------------------+
| 鈴木たかし            |
| 田中ゆうこ            |
| 福田だいすけ          |
| 豊島はなこ            |
| 不思議沢みちこ        |
+-----------------------+




Q.1
mysql> CREATE TABLE departments (
    -> department_id INT unsigned auto_increment PRIMARY KEY,
    -> name VARCHAR(20),
    -> created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    -> updated_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
    -> );
mysql> DESC departments
    -> ;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | YES  |     | NULL              |                                               |
| created_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+

mysql> ALTER TABLE departments MODIFY COLUMN name VARCHAR(20) NOT NULL;
mysql> DESC departments;
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type         | Null | Key | Default           | Extra                                         |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+
| department_id | int unsigned | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)  | NO   |     | NULL              |                                               |
| created_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp    | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+--------------+------+-----+-------------------+-----------------------------------------------+




Q.2
mysql> ALTER TABLE people ADD department_id INT unsigned AFTER email;
mysql> DESC people;
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| Field         | Type             | Null | Key | Default           | Extra                                         |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+
| person_id     | int unsigned     | NO   | PRI | NULL              | auto_increment                                |
| name          | varchar(20)      | NO   |     | NULL              |                                               |
| email         | varchar(255)     | YES  | UNI | NULL              |                                               |
| department_id | int unsigned     | YES  |     | NULL              |                                               |
| age           | tinyint unsigned | YES  |     | NULL              |                                               |
| gender        | tinyint          | YES  |     | NULL              |                                               |
| created_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED                             |
| updated_at    | timestamp        | YES  |     | CURRENT_TIMESTAMP | DEFAULT_GENERATED on update CURRENT_TIMESTAMP |
+---------------+------------------+------+-----+-------------------+-----------------------------------------------+




Q.3
mysql> INSERT INTO departments (name) 
    -> VALUES
    -> ('営業'),
    -> ('開発'),
    -> ('経理'),
    -> ('人事'),
    -> ('情報システム');
mysql> SELECT * FROM departments;
    +---------------+--------------------+---------------------+---------------------+
| department_id | name               | created_at          | updated_at          |
+---------------+--------------------+---------------------+---------------------+
|             1 | 営業               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             2 | 開発               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             3 | 経理               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             4 | 人事               | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
|             5 | 情報システム       | 2024-10-09 20:10:10 | 2024-10-09 20:10:10 |
+---------------+--------------------+---------------------+---------------------+

mysql> INSERT INTO people (name,email,department_id,age,gender)
    -> VALUES
    -> ('あ', 'email1', '1', '10', '1'),
    -> ('い', 'email2', '1', '15', '1'),
    -> ('う', 'email3', '1', '20', '1'),
    -> ('え', 'email4', '2', '25', '2'),
    -> ('お', 'email5', '2', '30', '2'),
    -> ('か', 'email6', '2', '35', '2'),
    -> ('き', 'email7', '2', '40', '2'),
    -> ('く', 'email8', '3', '45', '1'),
    -> ('け', 'email9', '4', '50', '2'),
    -> ('こ', 'email10', '5', '55', '1');
    mysql> SELECT name, email, department_id, age, gender FROM people;
    +-----------------------+---------------------+---------------+------+--------+
| name                  | email               | department_id | age  | gender |
+-----------------------+---------------------+---------------+------+--------+
| 鈴木たかし            | suzuki@gizumo.jp    |          NULL |   20 |      1 |
| 田中ゆうこ            | tanaka@gizumo.jp    |          NULL |   25 |      2 |
| 福田だいすけ          | fukuda@gizumo.jp    |          NULL |   42 |      1 |
| 豊島はなこ            | toyoshima@gizumo.jp |          NULL |   34 |      2 |
| 不思議沢みちこ        | NULL                |          NULL | NULL |   NULL |
| あ                    | email1              |             1 |   10 |      1 |
| い                    | email2              |             1 |   15 |      1 |
| う                    | email3              |             1 |   20 |      1 |
| え                    | email4              |             2 |   25 |      2 |
| お                    | email5              |             2 |   30 |      2 |
| か                    | email6              |             2 |   35 |      2 |
| き                    | email7              |             2 |   40 |      2 |
| く                    | email8              |             3 |   45 |      1 |
| け                    | email9              |             4 |   50 |      2 |
| こ                    | email10             |             5 |   55 |      1 |
+-----------------------+---------------------+---------------+------+--------+

mysql> INSERT INTO reports (person_id, content)
    -> VALUES
    -> ('7', 'あいうえおあいうえお'),
    -> ('8', 'かきくけこさしすせそ'),
    -> ('9', 'たちつてとなにぬねの'),
    -> ('10', 'はひふへほまみむめも'),
    -> ('11', 'わたしはわたしは私は'),
    -> ('12', 'カンガルーカンガルー'),
    -> ('13', 'ラッパラッパラッパラッパ'),
    -> ('14', 'けん玉けん玉けん玉けん玉'),
    -> ('15', '音声音声音声音声音声音声'),
    -> ('16', '難しい難しい難しい難しい');
mysql> SELECT * FROM reports;
+-----------+-----------+--------------------------------------+---------------------+---------------------+
| report_id | person_id | content                              | created_at          | updated_at          |
+-----------+-----------+--------------------------------------+---------------------+---------------------+
|         1 |         7 | あいうえおあいうえお                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         2 |         8 | かきくけこさしすせそ                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         3 |         9 | たちつてとなにぬねの                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         4 |        10 | はひふへほまみむめも                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         5 |        11 | わたしはわたしは私は                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         6 |        12 | カンガルーカンガルー                 | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         7 |        13 | ラッパラッパラッパラッパ             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         8 |        14 | けん玉けん玉けん玉けん玉             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|         9 |        15 | 音声音声音声音声音声音声             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
|        10 |        16 | 難しい難しい難しい難しい             | 2024-10-09 20:40:52 | 2024-10-09 20:40:52 |
+-----------+-----------+--------------------------------------+---------------------+---------------------+




Q.4
mysql> UPDATE people SET department_id =4 WHERE person_id IN(1,2,3,4,6);
mysql> SELECT * FROM people;
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                  | email               | department_id | age  | gender | created_at          | updated_at          |
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし            | suzuki@gizumo.jp    |             4 |   20 |      1 | 2024-10-06 16:08:33 | 2024-10-10 20:13:20 |
|         2 | 田中ゆうこ            | tanaka@gizumo.jp    |             4 |   25 |      2 | 2024-10-06 16:19:19 | 2024-10-10 20:13:20 |
|         3 | 福田だいすけ          | fukuda@gizumo.jp    |             4 |   42 |      1 | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         4 | 豊島はなこ            | toyoshima@gizumo.jp |             4 |   34 |      2 | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         6 | 不思議沢みちこ        | NULL                |             4 | NULL |   NULL | 2024-10-06 16:19:19 | 2024-10-10 20:14:56 |
|         7 | あ                    | email1              |             1 |   10 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|         8 | い                    | email2              |             1 |   15 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|         9 | う                    | email3              |             1 |   20 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        10 | え                    | email4              |             2 |   25 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        11 | お                    | email5              |             2 |   30 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        12 | か                    | email6              |             2 |   35 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        13 | き                    | email7              |             2 |   40 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        14 | く                    | email8              |             3 |   45 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        15 | け                    | email9              |             4 |   50 |      2 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
|        16 | こ                    | email10             |             5 |   55 |      1 | 2024-10-09 20:26:00 | 2024-10-09 20:26:00 |
+-----------+-----------------------+---------------------+---------------+------+--------+---------------------+---------------------+




Q.5
mysql> SELECT name,age FROM people WHERE gender =1 ORDER BY age DESC;
+--------------------+------+
| name               | age  |
+--------------------+------+
| こ                 |   55 |
| く                 |   45 |
| 福田だいすけ       |   42 |
| 鈴木たかし         |   20 |
| う                 |   20 |
| い                 |   15 |
| あ                 |   10 |
+--------------------+------+




Q.6
FROMで表示したいデータがあるテーブル（people）を選択する。
SELECTでどのカラム（name,email,age）を表示するか、WHEREで特定のレコード（department_id = 1）を指定する。
それによりpeopleテーブルにいるdepartment_id = 1の人のname,email,ageの情報のみ表示される。
また、ORDER BYのカラム名がcreated_at（コンテンツの作成日時）でASDやDESCが指定されていない。
よってデフォルトのASDが指定される為、コンテンツの作成日時順に上から表示される。




Q.7
mysql> SELECT name FROM people WHERE age >= 20 AND age < 30 AND gender = 2 OR age >= 40 AND age < 50 AND gender = 1;
+--------------------+
| name               |
+--------------------+
| 田中ゆうこ         |
| 福田だいすけ       |
| え                 |
| く                 |
+--------------------+




Q.8
mysql> SELECT name FROM people WHERE department_id =1 ORDER BY age ASC;
+------+
| name |
+------+
| あ   |
| い   |
| う   |
+------+




Q.9
mysql> SELECT AVG(age) AS average_age FROM people WHERE gender = 2 AND  department_id = 2;
+-------------+
| average_age |
+-------------+
|     32.5000 |
+-------------+




Q.10
SELECT p.name, d.name, r.content FROM people p JOIN reports r  USING (person_id) JOIN departments d USING(department_id);
+------+--------------------+--------------------------------------+
| name | name               | content                              |
+------+--------------------+--------------------------------------+
| あ   | 営業               | あいうえおあいうえお                 |
| い   | 営業               | かきくけこさしすせそ                 |
| う   | 営業               | たちつてとなにぬねの                 |
| え   | 開発               | はひふへほまみむめも                 |
| お   | 開発               | わたしはわたしは私は                 |
| か   | 開発               | カンガルーカンガルー                 |
| き   | 開発               | ラッパラッパラッパラッパ             |
| く   | 経理               | けん玉けん玉けん玉けん玉             |
| け   | 人事               | 音声音声音声音声音声音声             |
| こ   | 情報システム       | 難しい難しい難しい難しい             |
+------+--------------------+--------------------------------------+




Q.11
SELECT p.name FROM people p LEFT OUTER JOIN reports r USING (person_id) WHERE content IS NULL;;
+-----------------------+
| name                  |
+-----------------------+
| 鈴木たかし            |
| 田中ゆうこ            |
| 福田だいすけ          |
| 豊島はなこ            |
| 不思議沢みちこ        |
+-----------------------+


